{
  "diseases": [
    {
      "id": "rosette_arachide",
      "name_fr": "Rosette de l'arachide",
      "name_wo": "Jegge bu gerte",
      "crops": ["arachide"],
      "symptoms_fr": "Feuilles jaunes et rabougries, nanisme de la plante, mosaique verte",
      "symptoms_wo": "Xobi yi mooy mboq ak ndaw, plant bi yemul baax",
      "cause": "Virus transmis par pucerons (Aphis craccivora)",
      "treatment_fr": "Pas de traitement curatif. Arracher les plants malades. Traiter contre les pucerons avec neem.",
      "treatment_wo": "Amul faj. Soppal plant yi jegge. Fajal pucerons ak neem.",
      "prevention_fr": "Semer tot en debut d'hivernage. Utiliser variete resistante (Fleur 11). Densifier le semis.",
      "prevention_wo": "Bey ganaar ci nawet bi. Jefandikool variete Fleur 11. Desseel bey bi.",
      "severity": "high"
    },
    {
      "id": "mildiou_mil",
      "name_fr": "Mildiou du mil",
      "name_wo": "Jegge bu dugub - mildiou",
      "crops": ["mil"],
      "symptoms_fr": "Duvet blanc sous les feuilles, decoloration, epis deformes ou absents",
      "symptoms_wo": "Fu xobi yi duvet bu weex, epi yi baaxul",
      "cause": "Champignon Sclerospora graminicola",
      "treatment_fr": "Arracher les plants atteints. Pas de fongicide efficace en plein champ.",
      "treatment_wo": "Soppal plant yi jegge. Amul medicament bu baax.",
      "prevention_fr": "Utiliser semences certifiees (IBV 8004 tolerant). Rotation des cultures. Ne pas garder de semences de champs infectes.",
      "prevention_wo": "Jefandikool semences certifiees IBV 8004. Weccil tool yi. Buleen dugal semences ci tool bu jegge.",
      "severity": "high"
    },
    {
      "id": "pyriculariose_riz",
      "name_fr": "Pyriculariose du riz",
      "name_wo": "Jegge bu malo - blast",
      "crops": ["riz"],
      "symptoms_fr": "Taches en forme de losange sur feuilles, cou de l'epi noirci, verse des panicules",
      "symptoms_wo": "Tache yi ci xob yi nek na ni losange, epi bi nbaxal na",
      "cause": "Champignon Magnaporthe oryzae",
      "treatment_fr": "Appliquer fongicide (tricyclazole) des les premiers symptomes. Drainer le champ.",
      "treatment_wo": "Dugal fongicide su jegge bi door. Soppal ndox bi ci tool bi.",
      "prevention_fr": "Varietes resistantes. Eviter exces d'azote. Gestion equilibree de l'irrigation.",
      "prevention_wo": "Jefandikool variete bu yemul. Buleen dugal azote bu bari. Meesaleel ndox bi.",
      "severity": "high"
    },
    {
      "id": "tuta_absoluta",
      "name_fr": "Mineuse de la tomate (Tuta absoluta)",
      "name_wo": "Gunaar bu tamaate - Tuta",
      "crops": ["tomate"],
      "symptoms_fr": "Galeries dans les feuilles, fruits perfores avec dejections, plant affaibli",
      "symptoms_wo": "Yoon yi ci biir xob yi, fruits yi am na fearr, plant bi yobbiku na",
      "cause": "Papillon Tuta absoluta (larves mineuses)",
      "treatment_fr": "Pieges a pheromones. Traitement au Bt (Bacillus thuringiensis). Enlever feuilles minees.",
      "treatment_wo": "Teg piege pheromone. Fajal ak Bt. Soppal xob yi gunaar nekkoon.",
      "prevention_fr": "Filets anti-insectes sur pepiniere. Rotation. Detruire les residus de culture apres recolte.",
      "prevention_wo": "Filet ci pepiniere bi. Weccil tool yi. Soonal residus yi ginnaaw rang.",
      "severity": "high"
    },
    {
      "id": "chenille_legionnaire",
      "name_fr": "Chenille legionnaire d'automne",
      "name_wo": "Gunaar bu mbaxal",
      "crops": ["mais", "mil"],
      "symptoms_fr": "Feuilles dechiquetees, cornet du mais detruit, dejections dans le cornet",
      "symptoms_wo": "Xob yi daq nanu, cornet bu mbaxal bi yaqwu na",
      "cause": "Spodoptera frugiperda",
      "treatment_fr": "Traitement au Bt. Insecticide botanique (neem). Introduction de Trichogrammes (lutte biologique).",
      "treatment_wo": "Fajal ak Bt walla neem. Dugal Trichogrammes (faj bu naturel).",
      "prevention_fr": "Semer tot. Associations culturales. Poussieres de cendre dans le cornet.",
      "prevention_wo": "Bey ganaar. Bokkal ak yeneen tool. Dugal sax ci cornet bi.",
      "severity": "medium"
    },
    {
      "id": "cercosporiose_arachide",
      "name_fr": "Cercosporiose de l'arachide",
      "name_wo": "Tache bu gerte - cercospora",
      "crops": ["arachide"],
      "symptoms_fr": "Taches brunes circulaires sur feuilles, defoliation precoce, baisse de rendement",
      "symptoms_wo": "Tache yu xonq yi ci xob yi, xob yi daanu ganaar",
      "cause": "Champignons Cercospora arachidicola et Phaeoisariopsis personata",
      "treatment_fr": "Fongicide a base de mancozebe. Traiter des l'apparition des symptomes.",
      "treatment_wo": "Fajal ak mancozebe su tache yi door fenk.",
      "prevention_fr": "Rotation 2-3 ans. Varietes tolerantes. Enfouir les residus de recolte.",
      "prevention_wo": "Weccil tool yi 2-3 at. Dugal residus yi ci biir suuf bi.",
      "severity": "medium"
    },
    {
      "id": "nematodes_tomate",
      "name_fr": "Nematodes a galles",
      "name_wo": "Nematodes bu tamaate",
      "crops": ["tomate", "oignon"],
      "symptoms_fr": "Galles sur racines, fletrissement, croissance reduite, jaunissement",
      "symptoms_wo": "Raxas yi ci waxtu yi am na galles, plant bi yobbiku na, xobi yi mboq na",
      "cause": "Meloidogyne spp.",
      "treatment_fr": "Solarisation du sol. Rotation avec cereales. Apport de matiere organique. Neem en traitement du sol.",
      "treatment_wo": "Tangal suuf bi ak soleil. Weccil ak cereales. Dugal fumier. Neem ci suuf bi.",
      "prevention_fr": "Ne pas replanter tomates au meme endroit. Utiliser plants sains. Compost bien decompose.",
      "prevention_wo": "Buleen bey tamaate ci menn tool. Jefandikool plant yi jur. Compost bu baax.",
      "severity": "medium"
    },
    {
      "id": "salinite_riz",
      "name_fr": "Stress salin du riz",
      "name_wo": "Keer bu malo - sel",
      "crops": ["riz"],
      "symptoms_fr": "Pointes des feuilles brulees, retard de croissance, tallage reduit, sterilite des epis",
      "symptoms_wo": "Xob yi sonn na ci kaw, malo bi yemul baax",
      "cause": "Salinite du sol et de l'eau d'irrigation (delta du Fleuve Senegal)",
      "treatment_fr": "Drainage et lessivage des sels. Apport de gypse. Varietes tolerantes (Sahel 201).",
      "treatment_wo": "Soppal ndox bi ngir sel bi dem. Jefandikool Sahel 201.",
      "prevention_fr": "Gestion de l'eau d'irrigation. Eviter remontees de nappe salee. Amenagement de digues.",
      "prevention_wo": "Meesaleel ndox bi. Tegal digues yi.",
      "severity": "medium"
    }
  ]
}
